
## Plan Result




<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.trusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;# Allow images needed to run supporting tools in Prow workload clusters.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n    namespaces:\n      - \&#34;external-secrets\&#34;\n      - \&#34;gatekeeper-system\&#34;\n  parameters:\n    images:\n      - \&#34;ghcr.io/external-secrets/external-secrets\&#34;\n      - \&#34;docker.io/openpolicyagent/gatekeeper\&#34;\n      - \&#34;eu.gcr.io/kyma-project\&#34;\n      - \&#34;eu.gcr.io/sap-kyma-neighbors-dev\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project\&#34;\n      - \&#34;europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\&#34;&#34;]
  * module.trusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;# Allow only images needed to run prowjobs.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-prowjobs-namespace\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n    namespaces:\n      - \&#34;default\&#34;\n  parameters:\n    images:\n      - \&#34;docker.io/aquasec/trivy\&#34;\n      - \&#34;docker.io/zricethezav/gitleaks\&#34;\n      - \&#34;docker.io/maven\&#34;\n      - \&#34;gcr.io/k8s-prow/checkconfig\&#34;\n      - \&#34;gcr.io/k8s-prow/generic-autobumper\&#34;\n      - \&#34;gcr.io/k8s-prow/label_sync\&#34;\n      - \&#34;gcr.io/k8s-prow/branchprotector\&#34;\n      - \&#34;gcr.io/k8s-prow/commenter\&#34;\n      - \&#34;gcr.io/k8s-prow/gencred\&#34;\n      - \&#34;gcr.io/k8s-prow/sidecar\&#34; # prowjob decoration\n      - \&#34;gcr.io/k8s-prow/clonerefs\&#34; # prowjob decoration\n      - \&#34;gcr.io/k8s-prow/initupload\&#34; # prowjob decoration\n      - \&#34;gcr.io/k8s-prow/entrypoint\&#34; # prowjob decoration\n      - \&#34;eu.gcr.io/kyma-project\&#34;\n      - \&#34;eu.gcr.io/sap-kyma-neighbors-dev\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project\&#34;\n      - \&#34;europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\&#34;&#34;]
  * module.untrusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;# Allow images needed to run supporting tools in Prow workload clusters.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n    namespaces:\n      - \&#34;external-secrets\&#34;\n      - \&#34;gatekeeper-system\&#34;\n  parameters:\n    images:\n      - \&#34;ghcr.io/external-secrets/external-secrets\&#34;\n      - \&#34;docker.io/openpolicyagent/gatekeeper\&#34;\n      - \&#34;eu.gcr.io/kyma-project\&#34;\n      - \&#34;eu.gcr.io/sap-kyma-neighbors-dev\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project\&#34;\n      - \&#34;europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\&#34;&#34;]
  * module.untrusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;# Allow only images needed to run prowjobs.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-prowjobs-namespace\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n    namespaces:\n      - \&#34;default\&#34;\n  parameters:\n    images:\n      - \&#34;docker.io/aquasec/trivy\&#34;\n      - \&#34;docker.io/zricethezav/gitleaks\&#34;\n      - \&#34;docker.io/maven\&#34;\n      - \&#34;gcr.io/k8s-prow/checkconfig\&#34;\n      - \&#34;gcr.io/k8s-prow/generic-autobumper\&#34;\n      - \&#34;gcr.io/k8s-prow/label_sync\&#34;\n      - \&#34;gcr.io/k8s-prow/branchprotector\&#34;\n      - \&#34;gcr.io/k8s-prow/commenter\&#34;\n      - \&#34;gcr.io/k8s-prow/gencred\&#34;\n      - \&#34;gcr.io/k8s-prow/sidecar\&#34; # prowjob decoration\n      - \&#34;gcr.io/k8s-prow/clonerefs\&#34; # prowjob decoration\n      - \&#34;gcr.io/k8s-prow/initupload\&#34; # prowjob decoration\n      - \&#34;gcr.io/k8s-prow/entrypoint\&#34; # prowjob decoration\n      - \&#34;eu.gcr.io/kyma-project\&#34;\n      - \&#34;eu.gcr.io/sap-kyma-neighbors-dev\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project\&#34;\n      - \&#34;europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\&#34;&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.trusted_workload_gatekeeper.kubectl_manifest.constraints["# Allow images needed to run supporting tools in Prow workload clusters.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"external-secrets\"\n      - \"gatekeeper-system\"\n  parameters:\n    images:\n      - \"ghcr.io/external-secrets/external-secrets\"\n      - \"docker.io/openpolicyagent/gatekeeper\"\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "K8sAllowedImages"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "prow-tools-namespaces"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sAllowedImages
            metadata:
              name: prow-tools-namespaces
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - external-secrets
                - gatekeeper-system
              parameters:
                images:
                - ghcr.io/external-secrets/external-secrets
                - docker.io/openpolicyagent/gatekeeper
                - eu.gcr.io/kyma-project
                - eu.gcr.io/sap-kyma-neighbors-dev
                - europe-docker.pkg.dev/kyma-project
                - europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.trusted_workload_gatekeeper.kubectl_manifest.constraints["# Allow only images needed to run prowjobs.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-prowjobs-namespace\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    images:\n      - \"docker.io/aquasec/trivy\"\n      - \"docker.io/zricethezav/gitleaks\"\n      - \"docker.io/maven\"\n      - \"gcr.io/k8s-prow/checkconfig\"\n      - \"gcr.io/k8s-prow/generic-autobumper\"\n      - \"gcr.io/k8s-prow/label_sync\"\n      - \"gcr.io/k8s-prow/branchprotector\"\n      - \"gcr.io/k8s-prow/commenter\"\n      - \"gcr.io/k8s-prow/gencred\"\n      - \"gcr.io/k8s-prow/sidecar\" # prowjob decoration\n      - \"gcr.io/k8s-prow/clonerefs\" # prowjob decoration\n      - \"gcr.io/k8s-prow/initupload\" # prowjob decoration\n      - \"gcr.io/k8s-prow/entrypoint\" # prowjob decoration\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "K8sAllowedImages"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "prow-prowjobs-namespace"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sAllowedImages
            metadata:
              name: prow-prowjobs-namespace
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - default
              parameters:
                images:
                - docker.io/aquasec/trivy
                - docker.io/zricethezav/gitleaks
                - docker.io/maven
                - gcr.io/k8s-prow/checkconfig
                - gcr.io/k8s-prow/generic-autobumper
                - gcr.io/k8s-prow/label_sync
                - gcr.io/k8s-prow/branchprotector
                - gcr.io/k8s-prow/commenter
                - gcr.io/k8s-prow/gencred
                - gcr.io/k8s-prow/sidecar
                - gcr.io/k8s-prow/clonerefs
                - gcr.io/k8s-prow/initupload
                - gcr.io/k8s-prow/entrypoint
                - eu.gcr.io/kyma-project
                - eu.gcr.io/sap-kyma-neighbors-dev
                - europe-docker.pkg.dev/kyma-project
                - europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.untrusted_workload_gatekeeper.kubectl_manifest.constraints["# Allow images needed to run supporting tools in Prow workload clusters.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"external-secrets\"\n      - \"gatekeeper-system\"\n  parameters:\n    images:\n      - \"ghcr.io/external-secrets/external-secrets\"\n      - \"docker.io/openpolicyagent/gatekeeper\"\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "K8sAllowedImages"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "prow-tools-namespaces"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sAllowedImages
            metadata:
              name: prow-tools-namespaces
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - external-secrets
                - gatekeeper-system
              parameters:
                images:
                - ghcr.io/external-secrets/external-secrets
                - docker.io/openpolicyagent/gatekeeper
                - eu.gcr.io/kyma-project
                - eu.gcr.io/sap-kyma-neighbors-dev
                - europe-docker.pkg.dev/kyma-project
                - europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.untrusted_workload_gatekeeper.kubectl_manifest.constraints["# Allow only images needed to run prowjobs.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-prowjobs-namespace\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    images:\n      - \"docker.io/aquasec/trivy\"\n      - \"docker.io/zricethezav/gitleaks\"\n      - \"docker.io/maven\"\n      - \"gcr.io/k8s-prow/checkconfig\"\n      - \"gcr.io/k8s-prow/generic-autobumper\"\n      - \"gcr.io/k8s-prow/label_sync\"\n      - \"gcr.io/k8s-prow/branchprotector\"\n      - \"gcr.io/k8s-prow/commenter\"\n      - \"gcr.io/k8s-prow/gencred\"\n      - \"gcr.io/k8s-prow/sidecar\" # prowjob decoration\n      - \"gcr.io/k8s-prow/clonerefs\" # prowjob decoration\n      - \"gcr.io/k8s-prow/initupload\" # prowjob decoration\n      - \"gcr.io/k8s-prow/entrypoint\" # prowjob decoration\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "K8sAllowedImages"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "prow-prowjobs-namespace"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sAllowedImages
            metadata:
              name: prow-prowjobs-namespace
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - default
              parameters:
                images:
                - docker.io/aquasec/trivy
                - docker.io/zricethezav/gitleaks
                - docker.io/maven
                - gcr.io/k8s-prow/checkconfig
                - gcr.io/k8s-prow/generic-autobumper
                - gcr.io/k8s-prow/label_sync
                - gcr.io/k8s-prow/branchprotector
                - gcr.io/k8s-prow/commenter
                - gcr.io/k8s-prow/gencred
                - gcr.io/k8s-prow/sidecar
                - gcr.io/k8s-prow/clonerefs
                - gcr.io/k8s-prow/initupload
                - gcr.io/k8s-prow/entrypoint
                - eu.gcr.io/kyma-project
                - eu.gcr.io/sap-kyma-neighbors-dev
                - europe-docker.pkg.dev/kyma-project
                - europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

  with kubernetes_service_account.trusted_workload_terraform_executor,
  on terraform-executor.tf line 35, in resource "kubernetes_service_account" "trusted_workload_terraform_executor":
  35: resource "kubernetes_service_account" "trusted_workload_terraform_executor" {

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

(and one more similar warning elsewhere)

```



<!-- github-comment: {"Command":"plan","PRNumber":7971,"Program":"tfcmt","SHA1":"5edb46c5b33850a88ff6d137c30a619a8686ddd1","Vars":{}} -->